Updating Reading material to be mermaid graphs instead of plant
